#dastyar-e matn
#mohammad ali aqooshani
#exam for: lists

history = []
hadithBank = ['هرکس که از خداوند موفقیت بخواهد و خود تلاشی نکند، خودش را مسخره کرده است. - امام رضا (ع)'  , 'هیچ فقری مثل نادانی و هیچ میراثی مانند ادب نیست. - امام علی (ع)' , 'هرکس در کودکی بپرسد، در بزرگسالی پاسخش را می یابد.-امام علی (ع)' , 'تشکر نمیکند از خدا، کسی که از مردم تشکر نمی کند.-پیامبر(ص)' , "  دانش اندک با عمل ، بهتر از دانش فراوان بى عمل است .- امام علی (ع) " , " پیروزى انسان بزرگوار ، نجات بخش است و پیروزى انسان فرومایه ، نابود کننده  -امام علی(ع)  " , "  دانش را بجویید هرچند در ژرفاى دریا فرو روید و خونتان بریزد .-امام صادق (ع) "]
ayeBank = ['یا ایها الذین آمنو لایسخر قوم من قوم : ای کسانی که ایمان آورده اید؛ نباید گروهی از شما گروه دیگر را مسخره کند' , 'ویل للمطففین : وای بر کم فروشان' , 'یا ایها الذین آمنو لم تقولون مالا تفعلون : ای کسانی که ایمان آوردید، برای گه میگویید چیزی را که به آن عمل نمیکنید؟' , 'و پروردگارت به زنبور عسل الهام كرد كه از كوهها و درختان و آنچه برمى‏افرازند [براى خود] خانه بساز-نحل:63' , 'و از باورها، رفتارها و گفتارهايى که بدانها علم ندارى پيروى مکن، زيرا گوش و چشم و دل، از همه اينها سؤال مى شود که آيا آنچه را دريافته بودند علم بود يا شک و ترديدى به همراه داشت.-اسرا:36 ' , " و اگر از جانب خود رحمتى به انسان بچشانيم و نعمتى در اختيارش نهيم، سپس آن را از او باز گيريم، به يقين او از اين که بار ديگر به نعمت هايى دست يابد نااميد مى شود و نعمت هايى که داشته ناسپاسى مى کند و آنها را از جانب خدا نمى شمرد.-هود:9 " , " براى انسان جز آنچه براى به دست آوردنش تلاش کرده است چيزى نيست-نجم:39  "]
faktBank = ["مسخره شدن در کودکی، تاثیرات منفی در روحیه ی انسان در بزگسالی دارد" , 'ورزش کردن علاوه بر سلامت جسمی، تاثیرات زیادی بر سلامت روحی دارد.' , "گند دقیقه تمرینات ذهنی و تمرکزی یا مدیتیشن، میتواند بازدهی ذهن در طول روز را افزایش میدهد و باعث شادابی می شود." , 'دریاچه ی زیبایی در قله ی کوه زیبای سبلان قرار دارد که نه ماه از سال یخ زده و سه ماه تابستان به زیبایی خود نمایی می کند.' , "تعداد افرادی که سالانه از نیش زنبور میمیرند بیشتر از کسانی است که سالانه از نیش مار میمیرند.   " , "  میزان انرزی که خورشید در یک ثانیه تولید میکند؛ برای تولید برق مورد نیاز تمام کشورهای جهان در مدت یک میلیون سال کافی است. "]
userBank = []
print('سلام. \n به دستیار متن خوش آمدید.')
while(True) :
    userSelect = input('فعالیت را انتخاب کنید. \n افزودن مطلب =افزودن / جستجو / سابقه / پایان کار سیستم = E \n')
    if userSelect == "افزودن" :
        userText = input('متن خود را وارد کنید \n :')
        if len(userText) < 750 :
            userBank.append(userText)
            print('متن شما با موفقیت به بانک کاربر اضافه شد.')
    elif userSelect == 'جستجو' :
        userSearch = input('متن جستجوی خود را وارد کنید. \n :')
        history.append(userSearch)
        natijeP = '********************************* \nنتایج جستجوی شما :'
        #-----------------IS SEARCHING...--------------------
        natije = []
        nH = 0#shomarande-ye hadith
        for i in hadithBank :
            if userSearch in i :
                natije.append(i)
                nH +=1
        natijeP += f'\n {nH} نتیجه در انبار حدیث :'
        for t in natije :
            natijeP += f'\n {t}'
        
        nA = 0#shomarande-ye Aye
        natije = []
        for i in ayeBank :
            if userSearch in i :
                natije.append(i)
                nA +=1
        natijeP += f'\n {nA} نتیجه در انبار آیه :'
        for t in natije :
            natijeP += f'\n {t}'
        
        nF = 0#shomarande-ye Fakts
        natije = []
        for i in faktBank :
            if userSearch in i :
                natije.append(i)
                nF +=1
        natijeP += f'\n {nF} نتیجه در انبار فکت :'
        for t in natije :
            natijeP += f'\n {t}'
        
        nU = 0#shomarande-ye User-Texts
        natije = []
        for i in userBank :
            if userSearch in i :
                natije.append(i)
                nU +=1
        natijeP += f'\n {nU} نتیجه در انبار کاربر :'
        for t in natije :
            natijeP += f'\n {t}'
        
        #------------------------SEARCH COMPLETE!--------------------
        print(natijeP)
    elif userSelect == 'سابقه' :
        print(history)
        userSelect = input('آیا مایل به پاک کردن سابقه هستید؟ (بله / خیر)')
        if userSelect == 'بله' :
            history.clear()
            print('حافظه جستجو پاک شد.')
    elif userSelect == 'E' or 'پایان' in userSelect :
        break
print('پایان کار سیستم. \n موفق باشید \t (:')